// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");
/*

 Это ветка Master. Она используется как список решенных в данном файле задач. Для переключения между задачами используйте
их названия, указанные ниже, или при помощи переключения веток на GitHub
    
        1. Задачи первого семинара:

git checkout Lesson1task2 - Задача 2. Напишите программу, которая на вход принимает два числа и выдаёт,
                                        какое число большее, а какое меньшее;
git checkout Lesson1task4 - Задача 4: Напишите программу, которая принимает на вход три числа
                                        и выдаёт максимальное из этих чисел;
git checkout Lesson1task6 - Задача 6: Напишите программу, которая на вход принимает число и выдаёт, 
                                        является ли число чётным (делится ли оно на два без остатка).
git checkout Lesson1task8 - Задача 8: Напишите программу, которая на вход принимает число (N), 
                                        а на выходе показывает все чётные числа от 1 до N.

        2. Задачи второго семинара:

git checkout Lesson2task10  Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает 
                                        вторую цифру этого числа.
git checkout Lesson2task13  Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, 
                                        что третьей цифры нет.
git checkout Lesson2task15  Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели,
                                         и проверяет, является ли этот день выходным.

        3. Задачи третьего (3) семинара:

git checkout Lesson3task19  Задача 19: Напишите программу, которая принимает на вход пятизначное число и проверяет,
                                       является ли оно палиндромом.
git checkout Lesson3task21  Задача 21: Напишите программу, которая принимает на вход координаты двух точек
                                       и находит расстояние между ними в 3D пространстве.
git checkout Lesson3task23  Задача 23: Напишите программу, которая принимает на вход число (N) 
                                       и выдаёт таблицу кубов чисел от 1 до N.
                          
         4. Задачи третьего (4) семинара:

git checkout Lesson4task19  Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.

git checkout Lesson4task27  Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

git checkout Lesson4task29  Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.    
       
       
        Задачи из лекций (для себя):

git checkout NonHomework1 - треугольник-фрактал из лекции
*/
