/*
Для перехода к оглавлению используйте git checkout master

 Задача 6: Напишите программу, которая на вход принимает число и выдаёт, 
является ли число чётным (делится ли оно на два без остатка).
*/

Console.WriteLine("Введите число для проверки на четность");
double a = double.TryParse