// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");
/*

 Это ветка Master. Она используется как список решенных в данном файле задач. Для переключения между задачами используйте
их названия, указанные ниже, или при помощи переключения веток на GitHub
    
        Задачи первого семинара:
git checkout Lesson1task2 - Задача 2. Напишите программу, которая на вход принимает два числа и выдаёт,
                                        какое число большее, а какое меньшее;
git checkout Lesson1task4 - Задача 4: Напишите программу, которая принимает на вход три числа
                                        и выдаёт максимальное из этих чисел;
git checkout Lesson1task6 - Задача 6: Напишите программу, которая на вход принимает число и выдаёт, 
                                        является ли число чётным (делится ли оно на два без остатка).
git checkout Lesson1task8 - Задача 8: Напишите программу, которая на вход принимает число (N), 
                                        а на выходе показывает все чётные числа от 1 до N.

        Задачи второго семинара:
git checkout Lesson2task10  Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает 
                                        вторую цифру этого числа.
git checkout Lesson2task13  Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, 
                                        что третьей цифры нет.
git checkout Lesson2task15  Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели,
                                         и проверяет, является ли этот день выходным.

        Задачи из лекций (для себя):

git checkout NonHomework1 - треугольник-фрактал из лекции
*/
